## Production: route53
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |             NAME              |
|----------|-------------------------------|
| recreate | `aws_route53_zone.website_en` |
|          | `aws_route53_zone.website_fr` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route53_zone.website_en must be replaced
-/+ resource "aws_route53_zone" "website_en" {
      ~ arn                 = "arn:aws:route53:::hostedzone/Z086257212TH2V42707AQ" -> (known after apply)
      ~ id                  = "Z086257212TH2V42707AQ" -> (known after apply)
      ~ name                = "design-system.cdssandbox.xyz" -> "design-system.alpha.canada.ca" # forces replacement
      ~ name_servers        = [
          - "ns-1109.awsdns-10.org",
          - "ns-1925.awsdns-48.co.uk",
          - "ns-44.awsdns-05.com",
          - "ns-817.awsdns-38.net",
        ] -> (known after apply)
      ~ primary_name_server = "ns-1925.awsdns-48.co.uk" -> (known after apply)
        tags                = {
            "CostCentre" = "gc-design-system-production"
            "Terraform"  = "true"
        }
      ~ zone_id             = "Z086257212TH2V42707AQ" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_route53_zone.website_fr must be replaced
-/+ resource "aws_route53_zone" "website_fr" {
      ~ arn                 = "arn:aws:route53:::hostedzone/Z0466285O5N2Q2J4XP6O" -> (known after apply)
      ~ id                  = "Z0466285O5N2Q2J4XP6O" -> (known after apply)
      ~ name                = "systeme-design.cdssandbox.xyz" -> "systeme-design.alpha.canada.ca" # forces replacement
      ~ name_servers        = [
          - "ns-1484.awsdns-57.org",
          - "ns-157.awsdns-19.com",
          - "ns-1711.awsdns-21.co.uk",
          - "ns-625.awsdns-14.net",
        ] -> (known after apply)
      ~ primary_name_server = "ns-157.awsdns-19.com" -> (known after apply)
        tags                = {
            "CostCentre" = "gc-design-system-production"
            "Terraform"  = "true"
        }
      ~ zone_id             = "Z0466285O5N2Q2J4XP6O" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ hosted_zone_id_website_en = "Z086257212TH2V42707AQ" -> (known after apply)
  ~ hosted_zone_id_website_fr = "Z0466285O5N2Q2J4XP6O" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
